sample/load-test.yml
# @doc https://artillery.io/docs/script-reference/
config:
  target: 127.0.0.1:8080
  phases:
    - duration: 10 #sec
      arrivalRate: 1
  plugins:
    loadbalancer:
      strategy: roundrobin
      targets:
        - target: 127.0.0.1:8000
          weight: 1
        - target: 127.0.0.1:8001
          weight: 1
  engines:
    # artillery-plugin-loadbalancer's specific configuration
    grpc:
      # specify .proto file basic information
      protobufDefinition:
        filepath: protobuf-definitions/backend/services/v1/hello.proto
        package: backend.services.v1
        service: HelloService
      # can overrider @grpc/proto-loader's configuration
      # https://www.npmjs.com/package/@grpc/proto-loader
      protoLoaderConfig:
        includeDirs: [ './protobuf-definitions' ]

scenarios:
  - name: test backend-service
    engine: grpc
    flow:
      - Hello:
          id: 1
          name: Alice
      - Hello:
          id: 2
          name: Bob